witalis3/UA3REO-DDC-Transceiver/STM32/Src/settings.c
#include "settings.h"
#include "stm32h7xx_hal.h"
#include "stm32h7xx_hal_rtc.h"
#include <stdio.h>
#include <stdlib.h>
#include "functions.h"
#include "trx_manager.h"
#include "lcd.h"
#include "fpga.h"
#include "main.h"
#include "bands.h"
#include "front_unit.h"

char version_string[19] = "2.9.0"; //1.2.3-yymmdd.hhmm (concatinate)

//W25Q16
IRAM2 static uint8_t Write_Enable = W25Q16_COMMAND_Write_Enable;
IRAM2 static uint8_t Sector_Erase = W25Q16_COMMAND_Sector_Erase;
IRAM2 static uint8_t Page_Program = W25Q16_COMMAND_Page_Program;
IRAM2 static uint8_t Read_Data = W25Q16_COMMAND_Read_Data;
IRAM2 static uint8_t Power_Down = W25Q16_COMMAND_Power_Down;
IRAM2 static uint8_t Get_Status = W25Q16_COMMAND_GetStatus;
IRAM2 static uint8_t Power_Up = W25Q16_COMMAND_Power_Up;

IRAM2 static uint8_t Address[3] = {0x00};
struct TRX_SETTINGS TRX;
struct TRX_CALIBRATE CALIBRATE = {0};
static uint8_t settings_bank = 1;
static bool EEPROM_Enabled = true;

IRAM2 static uint8_t write_clone[sizeof(TRX)] = {0};
IRAM2 static uint8_t read_clone[sizeof(TRX)] = {0};
IRAM2 static uint8_t verify_clone[sizeof(TRX)] = {0};

volatile bool NeedSaveSettings = false;
volatile bool NeedSaveCalibration = false;
volatile bool EEPROM_Busy = false;
VFO *CurrentVFO = &TRX.VFO_A;
VFO *SecondaryVFO = &TRX.VFO_B;

static void LoadSettingsFromEEPROM(void);
static bool EEPROM_Sector_Erase(uint8_t sector, bool force);
static bool EEPROM_Write_Data(uint8_t *Buffer, uint16_t size, uint8_t sector, bool verify, bool force);
static bool EEPROM_Read_Data(uint8_t *Buffer, uint16_t size, uint8_t sector, bool verif, bool force);
static void EEPROM_PowerDown(void);
static void EEPROM_PowerUp(void);
static void EEPROM_WaitWrite(void);
static uint8_t calculateCSUM(void);
static uint8_t calculateCSUM_EEPROM(void);

const char *MODE_DESCR[TRX_MODE_COUNT] = {
	"LSB",
	"USB",
	"CW",
	"NFM",
	"WFM",
	"AM",
	"SAM",
	"DIGL",
	"DIGU",
	"IQ",
	"LOOP",
	"NOTX",
};

void LoadSettings(bool clear)
{
	BKPSRAM_Enable();
	dma_memcpy(&TRX, BACKUP_SRAM_BANK1_ADDR, sizeof(TRX));
	// Check, the data in the backup sram is correct, otherwise we use the second bank
	if (TRX.ENDBit != 100 || TRX.flash_id != SETT_VERSION || TRX.csum != calculateCSUM())
	{
		dma_memcpy(&TRX, BACKUP_SRAM_BANK2_ADDR, sizeof(TRX));
		if (TRX.ENDBit != 100 || TRX.flash_id != SETT_VERSION || TRX.csum != calculateCSUM())
		{
			println("[ERR] BACKUP SRAM data incorrect");

			LoadSettingsFromEEPROM();
			if (TRX.ENDBit != 100 || TRX.flash_id != SETT_VERSION || TRX.csum != calculateCSUM())
			{
				println("[ERR] EEPROM Settings data incorrect");
			}
			else
			{
				println("[OK] Settings data succesfully loaded from EEPROM");
			}
		}
		else
		{
			println("[OK] Settings data succesfully loaded from BACKUP SRAM bank 2");
		}
	}
	else
	{
		println("[OK] Settings data succesfully loaded from BACKUP SRAM bank 1");
	}
	BKPSRAM_Disable();

	if (TRX.flash_id != SETT_VERSION || clear || TRX.ENDBit != 100 || TRX.csum != calculateCSUM()) // code to trace new clean flash
	{
		if (clear)
			println("[OK] Soft reset TRX");
		dma_memset(&TRX, 0x00, sizeof(TRX));
		//
		TRX.flash_id = SETT_VERSION; // Firmware ID in SRAM, if it doesn't match, use the default
		TRX.NeedGoToBootloader = false;
		//TRX
		TRX.selected_vfo = false;				  // current VFO (false - A)
		TRX.VFO_A.Freq = 7100000;				  // stored VFO-A frequency
		TRX.VFO_A.Mode = TRX_MODE_LSB;			  // saved VFO-A mode
		TRX.VFO_A.LPF_RX_Filter_Width = 2700;	  // saved bandwidth for VFO-A
		TRX.VFO_A.LPF_TX_Filter_Width = 2700;	  // saved bandwidth for VFO-A
		TRX.VFO_A.HPF_Filter_Width = 60;		  // saved bandwidth for VFO-A
		TRX.VFO_A.ManualNotchFilter = false;	  // notch filter to cut out noise
		TRX.VFO_A.AutoNotchFilter = false;		  // notch filter to cut out noise
		TRX.VFO_A.NotchFC = 1000;				  // cutoff frequency of the notch filter
		TRX.VFO_A.DNR_Type = 0;					  // digital noise reduction
		TRX.VFO_A.AGC = true;					  // AGC
		TRX.VFO_A.SQL = false;					  // SSB/FM Squelch
		TRX.VFO_A.FM_SQL_threshold_dbm = -70;			  // FM noise squelch
		TRX.VFO_B.Freq = 14150000;				  // stored VFO-B frequency
		TRX.VFO_B.Mode = TRX_MODE_USB;			  // saved VFO-B mode
		TRX.VFO_B.LPF_RX_Filter_Width = 2700;	  // saved bandwidth for VFO-B
		TRX.VFO_B.LPF_TX_Filter_Width = 2700;	  // saved bandwidth for VFO-B
		TRX.VFO_B.HPF_Filter_Width = 60;		  // saved bandwidth for VFO-B
		TRX.VFO_B.ManualNotchFilter = false;	  // notch filter to cut out noise
		TRX.VFO_B.AutoNotchFilter = false;		  // notch filter to cut out noise
		TRX.VFO_B.NotchFC = 1000;				  // cutoff frequency of the notch filter
		TRX.VFO_B.DNR_Type = 0;					  // digital noise reduction
		TRX.VFO_B.AGC = true;					  // AGC
		TRX.VFO_B.SQL = false;					  // SSB/FM Squelch
		TRX.VFO_B.FM_SQL_threshold_dbm = -70;			  // FM noise squelch
		TRX.Fast = true;						  // accelerated frequency change when the encoder rotates
		TRX.LNA = false;						  // LNA (Low Noise Amplifier)
		TRX.ATT = false;						  // attenuator
		TRX.ATT_DB = 12.0f;						  // suppress the attenuator
		TRX.ATT_STEP = 6.0f;					  // step of tuning the attenuator
		TRX.RF_Filters = true;					  // LPF / HPF / BPF
		TRX.ANT = false;						  // ANT-1
		TRX.RF_Power = 20;						  //output power (%)
		TRX.ChannelMode = false;				//enable channel mode on VFO
		TRX.ShiftEnabled = false;				  // activate the SHIFT mode
		TRX.SHIFT_INTERVAL = 1000;				  // Detune range with the SHIFT knob (5000 = -5000hz / + 5000hz)
		TRX.TWO_SIGNAL_TUNE = false;			  // Two-signal generator in TUNE mode (1 + 2kHz)
		TRX.SAMPLERATE_MAIN = TRX_SAMPLERATE_K96; //Samplerate for ssb/cw/digi/nfm/etc modes
		TRX.SAMPLERATE_FM = TRX_SAMPLERATE_K192; //Samplerate for FM mode
		TRX.FRQ_STEP = 10;						  // frequency tuning step by the main encoder
		TRX.FRQ_FAST_STEP = 100;				  // frequency tuning step by the main encoder in FAST mode
		TRX.FRQ_ENC_STEP = 25000;				  // frequency tuning step by main add. encoder
		TRX.FRQ_ENC_FAST_STEP = 50000;			  // frequency tuning step by main add. encoder in FAST mode
		TRX.FRQ_CW_STEP_DIVIDER = 10;		// Step divider for CW mode
		TRX.Debug_Type = TRX_DEBUG_OFF;			  // Debug output to DEBUG / UART port
		TRX.BandMapEnabled = true;				  // automatic change of mode according to the range map
		TRX.InputType_MAIN = TRX_INPUT_MIC;			  // type of input to transfer (SSB/FM/AM)
		TRX.InputType_DIGI = TRX_INPUT_USB;			  // type of input to transfer (DIGI)
		TRX.AutoGain = false;					  // auto-control preamp and attenuator
		TRX.Locked = false;						  // Lock control
		TRX.CLAR = false;						  // Split frequency mode (receive one VFO, transmit another)
		TRX.Dual_RX = false;					  //Dual RX feature
		TRX.Dual_RX_Type = VFO_A_PLUS_B;		  // dual receiver mode
		TRX.Encoder_Accelerate = true;			  //Accelerate Encoder on fast rate
		strcpy(TRX.CALLSIGN, "HamRad");			  // Callsign
		strcpy(TRX.LOCATOR, "LO02RR");			  // Locator
		TRX.Transverter_Enabled = false;		  //Enable transverter mode
		TRX.Transverter_Offset_Mhz = 120;		  //Offset from VFO
		TRX.ATU_I = 0;									//ATU default state
		TRX.ATU_C = 0;									//ATU default state
		TRX.ATU_T = false;							//ATU default state
		TRX.ATU_Enabled = true;					//ATU enabled state
		//AUDIO
		TRX.IF_Gain = 70;								   // IF gain, dB (before all processing and AGC)
		TRX.AGC_GAIN_TARGET = -30;						   // Maximum (target) AGC gain
		TRX.MIC_GAIN = 1;								   // Microphone gain
		TRX.MIC_Boost = true;								// +20db mic amplifier
		TRX.RX_EQ_LOW = 0;								   // Receiver Equalizer (Low)
		TRX.RX_EQ_MID = 0;								   // Receiver EQ (mids)
		TRX.RX_EQ_HIG = 0;								   // Receiver EQ (high)
		TRX.MIC_EQ_LOW_SSB = 0;								   // Mic EQ (Low) SSB
		TRX.MIC_EQ_MID_SSB = 0;								   // Mic Equalizer (Mids) SSB
		TRX.MIC_EQ_HIG_SSB = 0;								   // Mic EQ (high) SSB
		TRX.MIC_EQ_LOW_AMFM = 0;								   // Mic EQ (Low) AM/FM
		TRX.MIC_EQ_MID_AMFM = 0;								   // Mic Equalizer (Mids) AM/FM
		TRX.MIC_EQ_HIG_AMFM = 0;								   // Mic EQ (high) AM/FM
		TRX.MIC_REVERBER = 0;							   // Mic Reveerber
		TRX.DNR1_SNR_THRESHOLD = 50;						   // Digital noise reduction 1 level
		TRX.DNR2_SNR_THRESHOLD = 30;						   // Digital noise reduction 2 level
		TRX.DNR_AVERAGE = 2;							   // DNR averaging when looking for average magnitude
		TRX.DNR_MINIMAL = 99;							   // DNR averaging when searching for minimum magnitude
		TRX.NOISE_BLANKER = true;						   // suppressor of short impulse noise NOISE BLANKER
		TRX.RX_AGC_SSB_speed = 10;						   // AGC receive rate on SSB
		TRX.RX_AGC_CW_speed = 1;						   // AGC receive rate on CW
		TRX.RX_AGC_Max_gain = 30;						//Maximum AGC gain
		TRX.RX_AGC_Hold = 700;						//AGC Hold time on peaks
		TRX.TX_Compressor_speed_SSB = 3;					   // TX compressor speed SSB
		TRX.TX_Compressor_maxgain_SSB = 10;					   //TX compressor max gain SSB
		TRX.TX_Compressor_speed_AMFM = 3;					   // TX compressor speed AM/FM
		TRX.TX_Compressor_maxgain_AMFM = 10;					   //TX compressor max gain AM/FM
		TRX.CW_LPF_Filter = 300;						   // default value of CW filter width
		TRX.SSB_LPF_RX_Filter = 2700;					   // default value of SSB filter width
		TRX.SSB_LPF_TX_Filter = 2700;					   // default value of SSB filter width
		TRX.SSB_HPF_Filter = 300;						   // default value of SSB filter width
		TRX.AM_LPF_RX_Filter = 6000;					   // default value of AM filter width
		TRX.AM_LPF_TX_Filter = 6000;					   // default value of AM filter width
		TRX.FM_LPF_RX_Filter = 10000;					   // default value of the FM filter width
		TRX.FM_LPF_TX_Filter = 10000;					   // default value of the FM filter width
		TRX.Beeper = true;								   //Keyboard beeper
		TRX.CTCSS_Freq = 0;									//CTCSS FM Frequency
		//CW
		TRX.CWDecoderEnabled = false;			 // automatic telegraph decoder
		TRX.CW_Pitch = 600; // LO offset in CW mode
		TRX.CW_Key_timeout = 200;		 // time of releasing transmission after the last character on the key
		TRX.CW_SelfHear = true;			 // self-control CW
		TRX.CW_KEYER = true;			 // Automatic key
		TRX.CW_KEYER_WPM = 30;			 // Automatic key speed
		TRX.CW_GaussFilter = false;		 //Gauss responce LPF filter
		TRX.CW_DotToDashRate = 3.0f;		// Dot To Dash length rate
		TRX.CW_Iambic = false;			//CW Iambic Keyer
		//SCREEN
		TRX.ColorThemeId = 0;	//Selected Color theme
		TRX.LayoutThemeId = 0;	//Selected Layout theme
		TRX.FFT_Enabled = true; // use FFT spectrum
#ifdef LAY_800x480
		TRX.FFT_Zoom = 1;	// approximation of the FFT spectrum
		TRX.FFT_ZoomCW = 8; // zoomfft for cw mode
#else
		TRX.FFT_Zoom = 2;	// approximation of the FFT spectrum
		TRX.FFT_ZoomCW = 8; // zoomfft for cw mode
#endif
		TRX.LCD_Brightness = 60;	 //LCD Brightness
		TRX.WTF_Moving = true;		 //move WTF with frequency encoder
		TRX.FFT_Automatic = true;	 //Automatic FFT Scale
		TRX.FFT_Sensitivity = 8;	 //Threshold of FFT autocalibrate
		TRX.FFT_Speed = 3;			 // FFT Speed
		TRX.FFT_Averaging = 4;		 // averaging the FFT to make it smoother
		TRX.FFT_Window = 1;			 //FFT Window
		TRX.FFT_Height = 2;			 // FFT display height
		TRX.FFT_Style = 1;			 // FFT style
		TRX.FFT_Color = 1;			 // FFT display color
		TRX.FFT_Compressor = true;	 //Compress FFT Peaks
		TRX.FFT_FreqGrid = 1;			 // FFT freq grid style
		TRX.FFT_dBmGrid = false;			 // FFT power grid
		TRX.FFT_Background = true;	 //FFT gradient background
		TRX.FFT_Lens = false;		 //FFT lens effect
		TRX.FFT_HoldPeaks = false;	 // Show FFT Peaks
		TRX.FFT_3D = 0;				 //FFT 3D mode
		TRX.FFT_ManualBottom = -130; //Minimal threshold for manual FFT scale
		TRX.FFT_ManualTop = -40;	 //Maximum threshold for manual FFT scale
		TRX.RDS_Decoder = true;		//RDS Decoder panel
		TRX.FFT_DXCluster = false;	//Show DX cluster over FFT
		for (uint8_t i = 0; i < FUNCBUTTONS_COUNT; i++)
			TRX.FuncButtons[i] = i;
		//ADC
		TRX.ADC_Driver = true; // preamplifier (ADC driver)
		TRX.ADC_PGA = true;	   // ADC preamp
		TRX.ADC_RAND = true;   // ADC encryption (xor randomizer)
		TRX.ADC_SHDN = false;  // ADC disable
		TRX.ADC_DITH = false;  // ADC dither
		//WIFI
		TRX.WIFI_Enabled = true;					 // activate WiFi
		strcpy(TRX.WIFI_AP1, "WIFI-AP");			 // WiFi hotspot
		strcpy(TRX.WIFI_PASSWORD1, "WIFI-PASSWORD"); // password to the WiFi point 1
		strcpy(TRX.WIFI_AP2, "WIFI-AP");			 // WiFi hotspot
		strcpy(TRX.WIFI_PASSWORD2, "WIFI-PASSWORD"); // password to the WiFi point 2
		strcpy(TRX.WIFI_AP3, "WIFI-AP");			 // WiFi hotspot
		strcpy(TRX.WIFI_PASSWORD3, "WIFI-PASSWORD"); // password to the WiFi point 3
		TRX.WIFI_TIMEZONE = 3;						 // time zone (for time synchronization)
		TRX.WIFI_CAT_SERVER = false;				 // Server for receiving CAT commands via WIFI
		//SERVICES
		TRX.SPEC_Begin = 1000;		// start spectrum analyzer range
		TRX.SPEC_End = 30000;		// end of spectrum analyzer range
		TRX.SPEC_TopDBM = -60;		// chart thresholds
		TRX.SPEC_BottomDBM = -130;	// chart thresholds
		TRX.WSPR_FREQ_OFFSET = 0;	//offset beacon from creq center
		TRX.WSPR_BANDS_160 = false; //enabled WSPR bands
		TRX.WSPR_BANDS_80 = true;
		TRX.WSPR_BANDS_40 = true;
		TRX.WSPR_BANDS_30 = true;
		TRX.WSPR_BANDS_20 = true;
		TRX.WSPR_BANDS_17 = true;
		TRX.WSPR_BANDS_15 = true;
		TRX.WSPR_BANDS_12 = true;
		TRX.WSPR_BANDS_10 = true;
		TRX.WSPR_BANDS_6 = false;
		TRX.WSPR_BANDS_2 = false;
		//
		TRX.ENDBit = 100; // Bit for the end of a successful write to eeprom

		//Default Bands settings
		for (uint8_t i = 0; i < BANDS_COUNT; i++)
		{
			TRX.BANDS_SAVED_SETTINGS[i].Freq = BANDS[i].startFreq + (BANDS[i].endFreq - BANDS[i].startFreq) / 2; // saved frequencies by bands
			TRX.BANDS_SAVED_SETTINGS[i].Mode = (uint8_t)getModeFromFreq(TRX.BANDS_SAVED_SETTINGS[i].Freq);
			TRX.BANDS_SAVED_SETTINGS[i].LNA = TRX.LNA;
			TRX.BANDS_SAVED_SETTINGS[i].ATT = TRX.ATT;
			TRX.BANDS_SAVED_SETTINGS[i].ATT_DB = TRX.ATT_DB;
			TRX.BANDS_SAVED_SETTINGS[i].ANT = TRX.ANT;
			TRX.BANDS_SAVED_SETTINGS[i].ADC_Driver = TRX.ADC_Driver;
			if(TRX.BANDS_SAVED_SETTINGS[i].Freq < 70000000)
				TRX.BANDS_SAVED_SETTINGS[i].SQL = false;
			else
				TRX.BANDS_SAVED_SETTINGS[i].SQL = true;
			TRX.BANDS_SAVED_SETTINGS[i].FM_SQL_threshold_dbm = TRX.VFO_A.FM_SQL_threshold_dbm;
			TRX.BANDS_SAVED_SETTINGS[i].ADC_PGA = TRX.ADC_PGA;
			TRX.BANDS_SAVED_SETTINGS[i].DNR_Type = 0;
			TRX.BANDS_SAVED_SETTINGS[i].AGC = true;
			TRX.BANDS_SAVED_SETTINGS[i].SAMPLERATE = TRX.SAMPLERATE_MAIN;
		}
		
		//Shadow variables
		TRX.SQL_shadow = TRX.VFO_A.SQL;
		TRX.FM_SQL_threshold_dbm_shadow = TRX.VFO_A.FM_SQL_threshold_dbm;

