witalis3/UA3REO-DDC-Transceiver/STM32/Src/settings.c
		uint32_t BigAddress = sector * W25Q16_SECTOR_SIZE;
		Address[2] = (BigAddress >> 16) & 0xFF;
		Address[1] = (BigAddress >> 8) & 0xFF;
		Address[0] = BigAddress & 0xFF;

		bool res = SPI_Transmit(&Read_Data, NULL, 1, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, true, SPI_EEPROM_PRESCALER, false); // Read Command
		if (!res)
		{
			EEPROM_Enabled = false;
			println("[ERR] EEPROM not found...");
			LCD_showError("EEPROM init error", true);
			SPI_process = false;
			return true;
		}

		SPI_Transmit(Address, NULL, 3, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, true, SPI_EEPROM_PRESCALER, false);					   // Write Address
		SPI_Transmit(NULL, (uint8_t *)(read_clone), size, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, false, SPI_EEPROM_PRESCALER, false); // Read

		Aligned_CleanInvalidateDCache_by_Addr((uint32_t *)read_clone, size);

		for (uint16_t i = 0; i < size; i++)
			if (read_clone[i] != Buffer[i])
			{
				//println("read err", read_clone[i]);
				SPI_process = false;
				return false;
			}
	}
	if (!force)
		SPI_process = false;
	return true;
}

static void EEPROM_WaitWrite(void)
{
	if (!EEPROM_Enabled)
		return;
	uint8_t status = 0;
	uint8_t tryes = 0;
	do
	{
		tryes++;
		SPI_Transmit(&Get_Status, NULL, 1, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, true, SPI_EEPROM_PRESCALER, false); // Get Status command
		SPI_Transmit(NULL, &status, 1, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, false, SPI_EEPROM_PRESCALER, false);	   // Read data
		if ((status & 0x01) == 0x01)
			HAL_Delay(1);
	} while ((status & 0x01) == 0x01 && (tryes < 200));
	if (tryes == 200)
	{
		println("[ERR]EEPROM Lock wait error");
		print_flush();
	}
}

static void EEPROM_PowerDown(void)
{
	if (!EEPROM_Enabled)
		return;
	SPI_Transmit(&Power_Down, NULL, 1, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, false, SPI_EEPROM_PRESCALER, false); // Power_Down Command
}

static void EEPROM_PowerUp(void)
{
	if (!EEPROM_Enabled)
		return;
	SPI_Transmit(&Power_Up, NULL, 1, W25Q16_CS_GPIO_Port, W25Q16_CS_Pin, false, SPI_EEPROM_PRESCALER, false); // Power_Up Command
}

void BKPSRAM_Enable(void)
{
	//__HAL_RCC_BKPRAM_CLK_ENABLE();
	HAL_PWREx_EnableBkUpReg();
	HAL_PWR_EnableBkUpAccess();
}

void BKPSRAM_Disable(void)
{
	HAL_PWR_DisableBkUpAccess();
}

static uint8_t calculateCSUM(void)
{
	sd_crc_generate_table();
	uint8_t csum_old = TRX.csum;
	uint8_t csum_new = 0;
	TRX.csum = 0;
	uint8_t *TRX_addr = (uint8_t *)&TRX;
	for (uint16_t i = 0; i < sizeof(TRX); i++)
		csum_new = sd_crc7_byte(csum_new, *(TRX_addr + i));
	TRX.csum = csum_old;
	return csum_new;
}

static uint8_t calculateCSUM_EEPROM(void)
{
	sd_crc_generate_table();
	uint8_t csum_old = CALIBRATE.csum;
	uint8_t csum_new = 0;
	CALIBRATE.csum = 0;
	uint8_t *CALIBRATE_addr = (uint8_t *)&CALIBRATE;
	for (uint16_t i = 0; i < sizeof(CALIBRATE); i++)
		csum_new = sd_crc7_byte(csum_new, *(CALIBRATE_addr + i));
	CALIBRATE.csum = csum_old;
	return csum_new;
}

void RTC_Calibration(void)
{
	if (hrtc.Init.AsynchPrediv != CALIBRATE.RTC_Coarse_Calibration)
	{
		HAL_PWR_EnableBkUpAccess();
		hrtc.Init.AsynchPrediv = CALIBRATE.RTC_Coarse_Calibration;
		HAL_RTC_Init(&hrtc);
	}

	HAL_RTCEx_SetSmoothCalib(&hrtc, RTC_SMOOTHCALIB_PERIOD_32SEC, RTC_SMOOTHCALIB_PLUSPULSES_RESET, 0);

	//0.954 ppm (0.5 tick RTCCLK on 32 sec).
	//1.908 ppm (0.5 tick RTCCLK on 16 sec).
	//3.816 ppm (0.5 tick RTCCLK on 8 sec).

	//insert (clock TOO FAST, ADD cycles)
	if (CALIBRATE.RTC_Calibration > 0)
		HAL_RTCEx_SetSmoothCalib(&hrtc, RTC_SMOOTHCALIB_PERIOD_32SEC, RTC_SMOOTHCALIB_PLUSPULSES_SET, 512 - CALIBRATE.RTC_Calibration);

	//remove (clock TOO SLOW, REMOVE cycles)
	if (CALIBRATE.RTC_Calibration < 0)
	{
		uint32_t newval = -CALIBRATE.RTC_Calibration;
		HAL_RTCEx_SetSmoothCalib(&hrtc, RTC_SMOOTHCALIB_PERIOD_32SEC, RTC_SMOOTHCALIB_PLUSPULSES_RESET, newval);
	}
}
